// 32. Напишите программу замена элементов массива: 
// положительные элементы замените на соответствующие 
// отрицательные, и наоборот.
// [-4, -8, 8, 2] -> [4,8,-8, -2]


int[] ChangeSign(int[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = array[i] * (-1);
    }
    return array;
}

void PrintArray(int[] array)
{
    Console.Write($"[");
    for (int i = 0; i < array.Length - 1; i++)
    {
        Console.Write($"{array[i]}, ");
    }
    Console.Write($"{array[array.Length - 1]}]");
}

Console.Clear();
int[] arr = new int[] {-4, -8, 8, 2};
PrintArray(arr);
Console.Write($" -> ");
ChangeSign(arr);
PrintArray(arr);
Console.WriteLine();